In [2]:
import pandas as pd

In [3]:
customers_df = pd.read_csv("C:/Users/shanz/OneDrive/Desktop/Mid Term/wk8-customers.csv")
products_df = pd.read_csv ("C:/Users/shanz/OneDrive/Desktop/Mid Term/wk8-products.csv")
stores_df = pd.read_csv ("C:/Users/shanz/OneDrive/Desktop/Mid Term/wk8-stores.csv")
sales_df = pd.read_csv ("C:/Users/shanz/OneDrive/Desktop/Mid Term/wk8-sales.csv")
inventory_df = pd.read_csv ("C:/Users/shanz/OneDrive/Desktop/Mid Term/wk8-inventory.csv")

In [4]:
customers_df.head(10)

,customer_id,first_name,last_name,email,phone,address,city,state,zip_code,registration_date
0,1,James,Smith,james.smith@gmail.com,555-123-4567,123 Main St,New York,NY,10001,2021-03-15
1,2,Mary,Johnson,NaN,212.555.6789,456 Park Ave,New York,NY,10022,2020-11-02
2,3,John,Williams,jwilliams@yahoo.com,(555) 987-6543,789 Broadway,Los Angeles,California,90001-1234,2021-05-20
3,4,Patricia,Brown,pbrown@hotmail.com,5551234567,321 Elm St,Chicago,IL,60601,NaN
4,5,Robert,Jones,rjones23@gmail.com,555-987-3456,555 Pine St,Houston,TX,77002,2020-09-12
5,6,Jennifer,Miller,jmiller@outlook.com,NaN,898 Cedar Dr,Phoenix,AZ,85001,2021-02-28
6,7,Michael,Davis,mdavis@gmail.com,555.432.7654,742 Maple Ave,Philadelphia,PA,19103,2021-01-17
7,8,Linda,Garcia,lgarcia@yahoo.com,555 876 2345,953 Oak Ln,San Antonio,Texas,78205,2020-10-05
8,9,William,Rodriguez,wrodriguez@hotmail.com,5558889999,159 Washington Blvd,San Diego,CA,92101,2021-06-30
9,10,Elizabeth,Wilson,ewilson@gmail.com,(555) 333-2211,753 Lincoln Rd,Dallas,TX,75201,2020-08-22

In [5]:
products_df.head(10)

,product_id,product_name,category,subcategory,brand,price,cost,weight
0,1,Apple iPhone 13,Electronics,Smartphones,Apple,899.99,649.99,0.45
1,2,Samsung Galaxy S21,electronics,Smartphones,Samsung,799.99,539.99,0.50
2,3,Sony WH-1000XM4,ELECTRONICS,Headphones,Sony,349.99,210.00,0.60
3,4,Dell XPS 13,Electronics,Laptops,Dell,1299.99,899.99,2.80
4,5,Nike Classic Tee,Clothing,Shirts,Nike,24.99,12.50,0.20
5,6,Levi's Slim Jeans,clothing,Pants,Levi's,59.99,31.00,0.90
6,7,KitchenAid Stand Mixer,Home & Kitchen,Kitchen Appliances,KitchenAid,349.99,245.00,10.00
7,8,Cuisinart Coffee Maker,home & kitchen,Kitchen Appliances,Cuisinart,99.99,55.00,3.50
8,9,IKEA Malm Dresser,Home and Kitchen,Furniture,IKEA,179.99,85.00,NaN
9,10,Penguin Classics Collection,Books,Fiction,Penguin,49.99,27.50,2.00

In [6]:
stores_df.head(10)

,store_id,store_name,address,city,state,zip_code,region,size_sqft,opening_date
0,1,City Center,123 Retail Blvd,New York,NY,10001,Northeast,32500.0,2005-05-20
1,2,Mall of Chicago,456 Shopping Ave,Chicago,IL,60611,Midwest,45000.0,2007-08-15
2,3,Los Angeles Plaza,789 Commerce St,Los Angeles,CA,90001,West,55000.0,2004-03-10
3,4,Houston Galleria,321 Main St,Houston,Texas,77002,Southwest,NaN,2008-11-05
4,5,Phoenix Outlet,654 Desert Rd,Phoenix,AZ,85001,Southwest,18500.0,2010-06-30
5,6,Philadelphia Center,987 Market St,Philadelphia,PA,19103,Northeast,22000.0,2009-09-12
6,7,San Antonio Mall,741 River Walk,San Antonio,TX,78205,Southwest,35000.0,2012-04-22
7,8,San Diego Plaza,852 Pacific Hwy,San Diego,CA,92101,West,27500.0,2006-07-18
8,9,Dallas Galleria,963 Lone Star Blvd,Dallas,TX,75201-5555,Southwest,42000.0,NaN
9,10,Boston Outlet,159 Freedom Rd,Boston,Massachusetts,02108,Northeast,16500.0,2014-10-09

In [7]:
sales_df.head(5)

,sale_id,date,store_id,customer_id,product_id,quantity,total,payment_method
0,1,2022-01-15,3.0,12,5,2,49.98,Credit Card
1,2,2022-01-16,1.0,5,10,1,49.99,credit card
2,3,2022-01-18,2.0,8,3,1,349.99,DEBIT CARD
3,4,2022-01-20,4.0,20,7,1,349.99,Cash
4,5,2022-01-22,5.0,3,15,1,1599.99,CC

In [8]:
inventory_df.head(5)

,inventory_id,store_id,product_id,quantity_in_stock,last_restock_date,reorder_level
0,1,1,1,25,2022-10-15,10.0
1,2,1,5,42,2022-11-02,15.0
2,3,1,10,18,2022-09-30,8.0
3,4,1,15,5,2022-10-20,10.0
4,5,1,20,12,NaN,15.0

### Obtain summary statistics for numerical columns

In [9]:
products_df.describe()

       product_id        price         cost     weight
count   30.000000    30.000000    30.000000  28.000000
mean    15.500000   191.724000   203.159000   3.835714
std      8.803408   452.483576   278.924138   5.693236
min      1.000000 -1599.990000     1.800000   0.200000
25%      8.250000    46.990000    28.375000   0.500000
50%     15.500000   134.990000    82.500000   1.150000
75%     22.750000   322.490000   236.250000   3.750000
max     30.000000  1299.990000  1100.000000  25.000000

In [10]:
sales_df.describe()

         sale_id   store_id  customer_id  product_id   quantity        total
count  40.000000  39.000000    40.000000   40.000000  40.000000    40.000000
mean   20.500000   6.487179    14.075000   13.500000   1.625000   352.296500
std    11.690452   4.235637     8.303189    8.857852   0.952392   377.625776
min     1.000000   1.000000     1.000000    1.000000   1.000000    19.980000
25%    10.750000   3.000000     6.750000    5.750000   1.000000    99.737500
50%    20.500000   6.000000    13.500000   11.500000   1.000000   229.985000
75%    30.250000   9.500000    20.250000   21.250000   2.000000   352.487500
max    40.000000  15.000000    29.000000   30.000000   5.000000  1599.990000

In [11]:
inventory_df.describe()

       inventory_id   store_id  product_id  quantity_in_stock  reorder_level
count     75.000000  75.000000   75.000000          75.000000      69.000000
mean      38.000000   8.000000   12.733333          22.640000      12.681159
std       21.794495   4.349588    7.179801          13.923187       3.327659
min        1.000000   1.000000    1.000000           0.000000       8.000000
25%       19.500000   4.000000    6.500000          15.000000      10.000000
50%       38.000000   8.000000   13.000000          25.000000      10.000000
75%       56.500000  12.000000   19.000000          33.500000      15.000000
max       75.000000  15.000000   25.000000          45.000000      20.000000

# Check for missing values in all dataframes

In [15]:
customers_df.isnull().sum()

customer_id          0
first_name           0
last_name            0
email                3
phone                2
address              0
city                 0
state                0
zip_code             1
registration_date    3
dtype: int64

In [16]:
products_df.isnull().sum()

product_id      0
product_name    0
category        0
subcategory     0
brand           0
price           0
cost            0
weight          2
dtype: int64

In [17]:
stores_df.isnull().sum()

store_id        0
store_name      0
address         0
city            0
state           0
zip_code        0
region          0
size_sqft       2
opening_date    1
dtype: int64

In [18]:
sales_df.isnull().sum()

sale_id           0
date              1
store_id          1
customer_id       0
product_id        0
quantity          0
total             0
payment_method    1
dtype: int64

In [21]:
inventory_df.isnull().sum()

inventory_id         0
store_id             0
product_id           0
quantity_in_stock    0
last_restock_date    9
reorder_level        6
dtype: int64

## Display the data types of each column

In [22]:
customers_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        31 non-null     int64
 1   first_name         31 non-null     object
 2   last_name          31 non-null     object
 3   email              28 non-null     object
 4   phone              29 non-null     object
 5   address            31 non-null     object
 6   city               31 non-null     object
 7   state              31 non-null     object
 8   zip_code           30 non-null     object
 9   registration_date  28 non-null     object
dtypes: int64(1), object(9)
memory usage: 2.6+ KB

In [23]:
products_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    30 non-null     int64
 1   product_name  30 non-null     object
 2   category      30 non-null     object
 3   subcategory   30 non-null     object
 4   brand         30 non-null     object
 5   price         30 non-null     float64
 6   cost          30 non-null     float64
 7   weight        28 non-null     float64
dtypes: float64(3), int64(1), object(4)
memory usage: 2.0+ KB

In [24]:
stores_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   store_id      15 non-null     int64
 1   store_name    15 non-null     object
 2   address       15 non-null     object
 3   city          15 non-null     object
 4   state         15 non-null     object
 5   zip_code      15 non-null     object
 6   region        15 non-null     object
 7   size_sqft     13 non-null     float64
 8   opening_date  14 non-null     object
dtypes: float64(1), int64(1), object(7)
memory usage: 1.2+ KB

In [25]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sale_id         40 non-null     int64
 1   date            39 non-null     object
 2   store_id        39 non-null     float64
 3   customer_id     40 non-null     int64
 4   product_id      40 non-null     int64
 5   quantity        40 non-null     int64
 6   total           40 non-null     float64
 7   payment_method  39 non-null     object
dtypes: float64(2), int64(4), object(2)
memory usage: 2.6+ KB

In [26]:
inventory_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75 entries, 0 to 74
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   inventory_id       75 non-null     int64
 1   store_id           75 non-null     int64
 2   product_id         75 non-null     int64
 3   quantity_in_stock  75 non-null     int64
 4   last_restock_date  66 non-null     object
 5   reorder_level      69 non-null     float64
dtypes: float64(1), int64(4), object(1)
memory usage: 3.6+ KB

### 3. Basic Information Retrieval

In [31]:
# How many unique products are in the product catalog?
unique_products = products_df['product_id'].nunique()

In [32]:
print(unique_products)

30

In [35]:
# What are the top 5 most expensive products?
top_5_expensive_products = products_df.nlargest(5, 'price')

In [37]:
print(top_5_expensive_products[['product_name', 'price']])

          product_name    price
3          Dell XPS 13  1299.99
0      Apple iPhone 13   899.99
1   Samsung Galaxy S21   799.99
19    Dyson V11 Vacuum   599.99
26  Sony PlayStation 5   499.99

In [38]:
# Which store has the largest floor space?
largest_floor_space = stores_df.nlargest(1, 'size_sqft')

In [39]:
print(largest_floor_space[['store_name', 'size_sqft']])

          store_name  size_sqft
2  Los Angeles Plaza    55000.0

In [41]:
# What is the distribution of customers by state?
customers_by_state = customers_df['state'].value_counts()

In [43]:
print(customers_by_state)

state
TX                4
CA                3
NY                2
IL                1
California        1
AZ                1
PA                1
Texas             1
FL                1
OH                1
North Carolina    1
IN                1
Washington        1
CO                1
MA                1
Oregon            1
NV                1
MI                1
TN                1
Maryland          1
MD                1
KY                1
WI                1
NM                1
MO                1
Name: count, dtype: int64

## Data Cleaning

In [44]:
# 1. Handling Missing Values
dataframes = {
    "Customers": customers_df,
    "Products": products_df,
    "Stores": stores_df,
    "Sales": sales_df,
    "Inventory": inventory_df
}

In [45]:
for name, df in dataframes.items():
    print(f"--- Missing Values in {name} ---")
    print(df.isnull().sum())
    print("\n")

--- Missing Values in Customers ---
customer_id          0
first_name           0
last_name            0
email                3
phone                2
address              0
city                 0
state                0
zip_code             1
registration_date    3
dtype: int64


--- Missing Values in Products ---
product_id      0
product_name    0
category        0
subcategory     0
brand           0
price           0
cost            0
weight          2
dtype: int64


--- Missing Values in Stores ---
store_id        0
store_name      0
address         0
city            0
state           0
zip_code        0
region          0
size_sqft       2
opening_date    1
dtype: int64


--- Missing Values in Sales ---
sale_id           0
date              1
store_id          1
customer_id       0
product_id        0
quantity          0
total             0
payment_method    1
dtype: int64


--- Missing Values in Inventory ---
inventory_id         0
store_id             0
product_id           0
quantity_in_stock    0
last_restock_date    9
reorder_level        6
dtype: int64

In [49]:
#For numerical columns with missing values, replace them with the column mean
mean_weight = products_df['weight'].mean()
products_df['weight'] = products_df['weight'].fillna(mean_weight)

In [50]:
print(products_df['weight'].isnull().sum())

0

In [52]:
mean_reorder = inventory_df['reorder_level'].mean()
inventory_df['reorder_level'] = inventory_df['reorder_level'].fillna(mean_weight)

In [53]:
print(inventory_df['reorder_level'].isnull().sum())

0

In [56]:
#For categorical columns with missing values, replace them with the most frequent value
most_frequent_value = sales_df['payment_method'].mode()[0]
sales_df['payment_method'] = sales_df['payment_method'].fillna(most_frequent_value)

In [57]:
print(sales_df['payment_method'].isnull().sum())

0

In [59]:
most_frequent_value = customers_df['zip_code'].mode()[0]
customers_df['zip_code'] = customers_df['zip_code'].fillna(most_frequent_value)

In [61]:
print(customers_df['zip_code'].isnull().sum())

0

In [62]:
#3 For date columns with missing values, use forward fill or backward fill as appropriate
sales_df['date'] = sales_df['date'].ffill()

In [63]:
print(sales_df['date'].isnull().sum())

0

In [67]:
inventory_df['last_restock_date'] = inventory_df['last_restock_date'].ffill()

In [68]:
print(inventory_df['last_restock_date'].isnull().sum())

0

In [69]:
customers_df['registration_date'] = customers_df['registration_date'].ffill()

In [70]:
print(customers_df['registration_date'].isnull().sum())

0

## Removing Duplicates

In [73]:
#Check for and remove any duplicate entries in the customers and products dataframes
#Customers
customers_duplicates = customers_df.duplicated().sum()

In [79]:
print(f"Duplicate rows in Customers: {customers_duplicates}")

Duplicate rows in Customers: 0

In [80]:
#products duplicates

In [81]:
products_duplicates = products_df.duplicated().sum()

In [82]:
print(f"Duplicate rows in Products {products_duplicates}")

Duplicate rows in Products 0

In [ ]:
## Explanation on how duplicates were identified
#I used the function .duplicated() to identify the duplicates in both customers and products. However, both contaiined 0 duplicaes therefore I did not remove any rows
#Otherwise, I used .drop_duplicates() to remove the duplicates if any existed

In [83]:
customers_df = customers_df.drop_duplicates(subset=['customer_id'])

In [84]:
print(f"New Customer table size: {customers_df.shape}")

New Customer table size: (30, 10)

In [85]:
products_df = products_df.drop_duplicates(subset=['product_id'])

In [86]:
print(f"New Customer table size: {products_df.shape}")

New Customer table size: (30, 8)

## Discussion Questions

In [ ]:
# What are the key advantages of using Pandas for data cleaning compared to other methods?
#Pandas offers several advantages for data cleaning because it is fast, efficient, and easy to use. 
#It provides built-in functions to handle missing values, remove duplicates, and fix data types with minimal code. 
#Pandas allows quick inspection of data using functions like info() and describe(), which helps identify issues early. 
#The cleaning steps are repeatable and consistent, reducing manual errors

In [ ]:
#How would your approach to handling missing values differ if the missing data was not random but had a pattern or meaning?
# Pandas should be abale to analyze missing values rather than dropping values directly.
#Function like groupby() can help identify patterns across columns or categories. Imputation can then be done conditionally using Pandas logic rather than simple averages.

In [ ]:
#What types of data quality issues might not be immediately visible through simple DataFrame inspection methods?
#Some data quality issues are not easily visible through simple DataFrame inspection methods like head() or info(). 
#These include inconsistent data formats (such as mixed date or text formats within a column), hidden duplicates with slight spelling differences, 
#what are dataframe inand outliers that do not stand out at first glance. Logical inconsistencies, such as negative values where they are not valid, may also go unnoticed.

In [ ]:
#How would you document your data cleaning process to ensure reproducibility?
# To ensure reproducibility, the data cleaning process should be documented clearly
#Comments can be added to explain why each step was performed. Keeping the steps in a logical order helps others follow the process easily. 
#Saving the cleaned dataset and recording the original data source is also important.

In [ ]:
# In what scenarios might it be better to remove rows with missing values rather than imputing them?
#It may be better to remove rows with missing values when the number of missing entries is very small and removing them will not significantly affect the dataset. 
#If the missing values occur randomly and do not follow a meaningful pattern, dropping those rows is often safe.